#' Creeping Line  pattern
#' ===

#' Ορισμός χώρου εργασίας (directory)
#setwd("C:/cba_drones")

#' Φόρτωση όλων των βιβλιοθηκών που θα χρειασθούν για την ανάπτυξη του μοτίβου
library(TurtleGraphics)
library(maptools)
library(rgeos)
library(rgdal)
library(raster)
library(rasterVis)


#' Εισαγωγή του bounding box από το χώρο που είναι αποθηκευμένο. Το bounding box ορίζει την περιοχή μελέτης.
#' Στη συγκεκριμένη περίπτωση το αρχείο βρίσκεται σε μορφή kml. Ο ορισμός του προβολικού δεν είναι αναγκαίος σε αυτή
#' την περίπτωση όμως γίνεται ώς παράδειγμα στον εκάστοτε χρήστη που θα διαχειρίζεται άλλη μορφή αρχείων (π.χ shp.).
#' Προβολή της περιοχής μελέτης (bounding box).
area=readOGR("Data/bbox.kml",layer="bbox")
proj4string(area) = CRS("+proj=longlat +datum=WGS84 +no_defs")
plot(area)

#' Στο πρώτο στάδιο της ανάλυσης είναι χρήσιμο ο εκάστοτε χρήστης να γνωρίσει το μοτίβο που πρόκειται να αναπτύξει.
#' Για να γίνει πιο εύκολη η κατανόηση του μοτίβου προτείνεται η παρουσίαση ενός παραδείγματος αυτού.
browseURL("http://www.navdynamic.com.au/p_navigator-search-rescue-parallel.html")

#' Εισαγωγή του ψηφιακού μοντέλου εδάφους της περιοχής. Ο χρήστης ακολουθώντας τον παρακάτω σύνδεσμο θα
#' πρέπει να επιλέξει την περιοχή ενδιαφέροντός του και να κατεβάσει/αποθηκεύσει το ψηφιακό μοντέλο εδάφους.
browseURL("http://srtm.csi.cgiar.org/SELECTION/inputCoord.asp")

#' Έχοντας κατεβάσει και αποθηκεύσει το ψηφιακό μοντέλο εδάφους στο χώρο εργασίας (directory), επόμενο
#' βήμα είναι είναι η εισαγωγή του αρχείου στο πρόγραμμα. Λόγω της μορφής του αρχείου (raster) θα χρησιμο-
#' ποιηθεί η βιβλιοθήκη raster.
dem=raster("dem_lesvos.tif")
plot(dem)
str(dem)
plot3D(dem)
#' dem_matrix=as.matrix(dem)

#' Σύμφωνα με το μοτίβο, το σημείο έναρξης πτήσης της μη επανδρωμένης πλατφόρμας βρίσκεται στα όρια της περιοχής
#' μελέτης. Για το λόγο αυτό ο χρήστης ορίζει τις συντεταγμένες του σημείου έναρξης πτήσης καθώς και το προβο-
#' λικό σύστημα. Έπειτα γίνεται απεικόνιση του σημείου στην περιοχή ενδιαφέροντος.
point_start=SpatialPoints(cbind(26.24,39.24))
proj4string(point_start) = CRS("+proj=longlat +datum=WGS84 +no_defs")
plot(point_start)
plot(area,add=T)
x_first=26.24
y_first=39.24

#' Δημιουργία μιας κενής λίστας όπου θα αποθηκεύονται οι συντεταγμένες των ευθύγραμμων τμημάτων (legs) που
#' θα δημιουργηθούν από την εφαρμογή του μοτίβου. Τόσο το πλήθος των legs όσο όσο και μήκος αυτών ορίζεται από
#' τον εκάστοτε χρήστη. Χαρακτηριστικά αυτού του μοτίβου είναι πως το κάθε leg΄έχει το ίδιο μήκος με τα παράλληλα
#' σε ευτο ευθύγραμμα τμήματα. Αυτό σημαίνει οι τιμές του μήκους των ευθύγραμμων τμημάτων είναι συνήθως δύο διαφορετικές
#' και εναλλάσσονται νά ευθύγραμμο τμήμα. Σε αυτό το παράδειγμα το πλήθος των ευθύγραμμων τμημάτων ορίσθηκε στα 10
#' και το αρχικό μήκος (βήμα), στις 0.03 μοίρες(η μονάδα εξαρτάρται από το προβολικό σύστημα)
leg_list = list()
n=10
initial_step=0.03

#' Ορισμός χαρακτηριστικών του bounding box. Δηλώνονται το μήκος και το πλάτος αυτού, ενώ σε περίπτωση που το μοτίβο
#' βγαίνει εκτός ορίων περιοχής μελέτης (με το mode) θα γίνεται αυτόματα η κοπή αυτού στα όρια του bounding box.
#' Ορισμός θέσης του turtle στο σημείο έναρξης πτήσης.
turtle_init(width=0.173,height=0.211, mode = c("clip"))
turtle_setpos(x_first,y_first)

#' Ορισμός των χαρακτηριστικών του μοτίβου και δημιουργία αυτού μέσω loop. Ο χρήστης αρχικά ορίζει το σημείο έναρξης
#' πτήσης ως το σημείο από όπου θα ξεκινήσει το πρώτο ευθύγραμμο τμήμα(leg). Εφόσον βάση του μοτίβου τα παράλληλα
#' ευθύγραμμα τμήματα χαρακτηρίζονται από ίδιο μήκος, ορίζεται πως τα legs με ζυγό αριθμό θα έχουν αυξημένο μήκος
#' κατά 0.15 μοίρες από το αρχικό βήμα. τα υπόλοιπα legs θα έχουν μήκος 0.03 μοίρες όπως αρχικά είχε ορισθεί. Εκτός
#' από το μήκος των ευθύγραμμων τμημάτων, ορίζονται και τα χαρακτηριστικά της πτήσης. Κάθε τέσσερα ευθύγραμμα τμήματα
#' για δύο legs η μη επανδρωμένη πλατφόρμα θα εκτελεί στροφές των 90 μοιρών δεξιά. Οι στροφές για όλα τα υπόλοιπα
#' legs θα είναι 90 μοίρες προς τα αριστερά. Για να ορισθούν τα ευθύγραμμα τμήματα όπου οι στροφές θα πραγματοποιούνται
#' δεξιά, δημιουργείται ένα vector. Το vector αυτό θα αποθηκεύει τον αριθμό των δυάδων των legs ανά τέσσερα ευθύγραμμα τμήματα
#' (βάση του μοτίβου) για τις οποίες οι στροφές θα γίνονται δεξιά. Όταν η μη επανδρωμένη πλατφόρμα βρίσκεται σε κάποιο από τα legs
#' εντός των τιμών του vector, θα στρίβει κατά 90 μοίρες δεξιά. Σε αντίθετη περίπτωση, οι στροφές θα πραγματοποιούνται αριστερά
#' κατά 90 μοίρες. Για κάθε κόμβο των ευθύγραμμων τμημάτων θα αποθηκεύονται οι συντεταγμένες.

right=c((seq(1,n,4)),(seq(1,n,4))+1)

for (i in 1:n){

  if (i ==1){
    x_start = x_first
    y_start = y_first
    step = initial_step
  }else{
    x_start = x_end
    y_start = y_end
  }

  if(i%%2 == 0){

    step = initial_step + 0.15

  } else{
    step=initial_step
  }
  if (is.element(i,right)){
    turtle_right(angle=90)
    turtle_forward(dist=step)
  }else{
    turtle_left(angle=90)
    turtle_forward(dist=step)
  }
  y_end=turtle_getpos()[[2]]
  x_end=turtle_getpos()[[1]]
  leg_list[[i]]=c(y_start,x_start, y_end,x_end)


}

#' Άνοιγμα της λίστας με τις συντεταγμένες των ευθύγραμμων τμημάτων βάση του εύρους αυτών. Ορισμός των χαρακτηριστικών
#' των legs και απεικόνιση αυτών.
cr_range = range(unlist(leg_list))

for (k in 1:n){
  leg=leg_list[[k]]

}

#' Δημιουργία data.frame με τις συντεταγμένες των ευθύγραμμων τμημάτων. Ορισμός labels για τις στήλες.
creepingdf = data.frame(matrix(unlist(leg_list), ncol=4, byrow=T))
names(creepingdf)=c("y_from", "x_from", "y_to", "x_to")

#' Δημιουργία γραμμών μέσα από το data.frame με τις συντεταγμένες που δημιουργήθηκε.
lines = vector("list", nrow(creepingdf))
for (i in seq_along(lines)) {
  lines[[i]] <- Lines(list(Line(rbind(c(creepingdf$x_from[i],creepingdf$y_from[i]),  c(creepingdf$x_to[i], creepingdf$y_to[i]) ))), as.character(i))
}

#' Μετατροπή των γραμμών σε simple SpatialLines και ορισμός προβολικού συστήματος.
linessp = SpatialLines(lines)
proj4string(linessp) = CRS("+proj=longlat +datum=WGS84 +no_defs")

#' Μετατροπή από simple SpatialLines σε  SpatialLinesDataFrame με στόχο την μετέπειτα αποθήκευση του μοτίβου.
#' Ορισμός προβολικού συστήματος. Απεικόνιση του μοτίβου.
creepingSLDF = SpatialLinesDataFrame(linessp,creepingdf)
proj4string(creepingSLDF) = CRS("+proj=longlat +datum=WGS84 +no_defs")
plot(creepingSLDF)

#' Αποθήκευση του μοτίβου σε Shapefile
writeOGR(creepingSLDF, "path",layer="creeping line", driver="ESRI Shapefile", overwrite_layer = T)


