##########expanding_square_pattern###############
#ορισμός χώρου εργασίας
setwd("C:/cba_drones")
#φόρτωση όλων των βιβλιοθηκών που θα χρειασθούν στον κώδικα
library("TurtleGraphics")
library(maptools)
library(rgeos)
library(rgdal)
library(sp)


#ορισμός περιοχής μελέτης μέσα από τη δημιουργία bounding box. Αφού δημιουργηθεί το bounding box 
#γίνεται αποθήκευση στο directory που ορίσθηκε αρχικά και έπειτα εισάγεται στο Rstudio.
area=readShapeSpatial("bbox2.shp")
plot(area)

#πρώτο βήμα είναι ο ορισμός του προβολικού συστήματος. Στη συγκεκριμένη περίπτωση χρησιμοποιείται
#το WGS84. Αφού ορισθεί το προβολικό γίνεται απεικονίζεται η περιοχή μελέτης.
proj4string(area) = CRS("+proj=longlat +datum=WGS84 +no_defs")
#για την εκτέλεση του συγκεκριμένου μοτίβου (όπως φαίνεται και από το σχήμα του),η εκάστοτε μη επανδρωμένη
#πλατφόρμα θα ξεκινάει την πτήση από το κέντρο της περιοχής μελέτης που έχει ορίσει ο χρήστης. Για αυτό 
#το λόγο δημιουργείται το κεντροειδές του bounding box της περιοχής μελέτης. Και για αυτό το σημείο 
#ορίζεται το ίδιο προβολικό σύστημα ενώ γίνεται απεικόνιση αυτού σε συνδυασμό με το bounding box.
pointcenter = gCentroid(area,byid=FALSE)
proj4string(pointcenter) = CRS("+proj=longlat +datum=WGS84 +no_defs")
plot(pointcenter)
plot(area,add=T)

#ορισμός των συντεταγμένων του κεντροειδούς (του σημείου έναρξης)
x_first=26.3
y_first=39.1
#δημιουργία κενής λίστας όπου σε επόμενο στάδιο θα αποθηκευθούν τα ευθύγραμμα τμήματα που θα ακολουθήσει
#το uav (τα legs). Σε αυτή την περίπτωση ο αριθμός των legs που επιλέχθηκαν να δημιουργηθούν είναι n=10.
#Χαρακτηριστικό του μοτίβου είναι πως το μήκος των legs αυξάνει ανά δύο. το αρχικό μήκος ορίζεται στις 
#0.03 μοίρες.
leg_list = list()
n=10
initial_step=0.03


#χρήση του πακέτου TurtleGraphics για την εκτέλεση του μοτίβου.Ορισμός των διαστάσεων του bounding box
#όπου θα κινηθεί το turtle. σε περιπτώσεις όπου το μοτίβο ξεπερνά τα όρια του bounding box,θα περιορίζεται 
#(θα κόβεται) αυτόματα στα όρια αυτού.Εγκατάσταση του turtle στο σημείο έναρξης βάση συντεταγμένων. 
turtle_init(width=0.173,height=0.211, mode = c("clip"))
turtle_setpos(x_first,y_first)


#για τη δημιουργία των legs αρχικά γίνεται έλεγχος για να βρεθεί το leg στο οποίο βρίσκεται το UAV. 
#Εάν βρίσκεται στο πρώτο τότε ως αρχή ορίζεται το σημείο με συντεταγμένες αυτές του κεντροειδούς και 
#μήκος το αρχικό step(0.03 μοίρες). Σε κάθε άλλη περίπτωση ως αρχικό σημείο του leg ορίζεται το τελικό 
#σημείο του προηγούμενου. Επίσης γίνεται έλεγχος ώστε ανά δύο legs να γίνεται αύξηση του βήματος βάση 
#του αρχικού. Ουσιαστικά το βήμα ανά δύο legs θα διπλασιάζεται. Η πορεία που θα ακολουθεί 
#το turtle στη συγκεκριμένη περίπτωση είναι σταθερή. Θα προχωρά ευθεία ανάλογα με το μήκος των legs και 
#όλες οι στροφές που θα πραγματοποιεί θα είναι δεξιόστροφες των 90 μοιρών. Όλες οι συντεταγμένες των 
#αρχικών και τελικών σημείων των legs θα κρατώνται και θα αποθηκεύονται στη λίστα που έχει δημιουργηθεί
#σε προηγούμενο στάδιο. Με τη δημιουργία των legs, γίνεται unlist της λίστας που αποθηκεύθηκαν οι 
#συντεταγμένες και βάση του εύρους γίνεται η απεικόνιση του μοτίβου. Ορίζονται τα στοιχεία των αξόνων 
#καθώς και των legs(μέγεθος,χρώματα).